"auth/invalid-argument":"Se proporcionó un argumento no válido para un método de autenticación. El mensaje de error debe incluir información adicional.",
"auth/invalid-disabled-field":"El valor que se proporcionó para la propiedad de usuario disabled no es válido. Debe ser un booleano.",
"auth/invalid-display-name":"El valor que se proporcionó para la propiedad de usuario displayName no es válido. Debe ser una string que no esté vacía.",
"auth/invalid-email-verified":"El valor que se proporcionó para la propiedad de usuario emailVerified no es válido. Debe ser un booleano.",
"auth/invalid-email":"El valor que se proporcionó para la propiedad de usuario email no es válido. Debe ser una dirección de correo electrónico de string.",
"auth/invalid-password":"El valor que se proporcionó para la propiedad de usuario password no es válido. Debe ser una string con al menos seis caracteres.",
"auth/invalid-phone-number":"El valor que se proporcionó para phoneNumber no es válido. Debe ser una string de identificador que no esté vacía y que cumpla con el estándar E.164.",
"auth/invalid-photo-url":"El valor que se proporcionó para la propiedad de usuario photoURL no es válido. Debe ser una URL de string.",
"auth/invalid-uid":"El uid proporcionado debe ser una string no vacía con un máximo de 128 caracteres.",
"auth/missing-uid:":"Se requiere un identificador uid para la operación actual.",
"auth/uid-alread-exists":"Otro usuario ya está utilizando el uid proporcionado. Cada usuario debe tener un uid único.",
"auth/email-already-exists":"Otro usuario ya está utilizando el correo electrónico proporcionado. Cada usuario debe tener un correo electrónico único.",
"auth/user-not-found":"No existe ningún registro de usuario que corresponda al identificador proporcionado.",
"auth/operation-not-allowed":"El proveedor de acceso proporcionado está inhabilitado para tu proyecto de Firebase. Habilítalo desde la sección Método de acceso de Firebase console.",
"auth/invalid-credential":"La credencial utilizada para autenticar los SDK de Admin no se puede utilizar para realizar la acción deseada. Algunos métodos de autenticación como createCustomToken() y verifyIdToken() requieren que los SDK se inicialicen con una credencial de certificado en lugar de un token de actualización o una credencial predeterminada de la aplicación. Consulta Inicializar el SDK para ver documentación sobre cómo autenticar el SDK de Admin con una credencial de certificado.",
"auth/phone-number-already-exists":"Otro usuario ya está utilizando el phoneNumber proporcionado. Cada usuario debe tener un phoneNumber único.",
"auth/project-not-found":"No se encontró ningún proyecto de Firebase para la credencial que se usó para inicializar los SDK de administrador. Consulta Cómo agregar Firebase a tu app para ver la documentación sobre cómo generar una credencial para tu proyecto y usarla para autenticar los SDK de Admin.",
"auth/insufficient-permission":"La credencial que se usó para inicializar el SDK de Admin no tiene permisos suficientes para acceder al recurso de autenticación solicitado. Consulta Cómo agregar Firebase a tu app para ver la documentación sobre cómo generar una credencial con permisos apropiados y usarla para autenticar los SDK de Admin.",
"auth/internal-error":"El servidor de autenticación encontró un error inesperado al tratar de procesar la solicitud. El mensaje de error debe contener la respuesta del servidor de autenticación que contiene información adicional. Si el error persiste, informa el problema a nuestro canal de asistencia de informe de errores.